using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LaboratoryWorks
{
    public class LabWorkNumb5Task4
    {
        /*
        Пользователь вводит массив. Числа могут быть положительными, отрицательными, целыми или дробными. 
        Без изменения оригинального массива заменить все положительные целые числа в массиве на их факториал. 
        Отрицательные целые числа оставить без изменений. 
        Любое дробное число заменить на его дробную часть с откинутой целой частью, округленную до сотых. 
        Например, если число равно -12.067, то его нужно заменить на число 7 (округлили число -12.067 до сотых - получили -12.07, откинули целую часть - получили 7).

        Вывести для сравнения оригинальный массив, который не должен был поменяться, и результирующий массив.
        */
        public static void PrintProcesedInput()
        {

        }
    }
}
